package lesson6;

//3.  Фруктовая лавка. Создать абстрактный класс Фрукт и классы Яблоко, Груша, Абрикос расширяющие его. Класс Фрукт содержит: 
//a) переменную вес, 
//б) завершенный метод printManufacturerInfo(){System.out.print("Made in Ukraine");} 
//в) абстрактный метод, возвращающий стоимость фрукта, который должен быть переопределен в каждом классе наследнике. Метод должен учитывать вес фрукта.
//Создать несколько объектов разных классов. Подсчитать общую стоимость проданных фруктов. А также общую стоимость отдельно проданных яблок, груш и абрикос.
//4.  Создать класс Circle, который содержит 
// - переменную radius;
// - методы, вычисляющие площадь и длину окружности;
// - константу PI.
//Создать несколько объектов данного класса.

public abstract class Fruit {
	protected double weight;

	public Fruit(double weight) {
		this.weight = weight;
	}

	public final void printManufacturerInfo() {
		System.out.print("Made in Ukraine");
	}

	public abstract void fullPrice();

}
